In [1]:
import pandas as pd
data = pd.DataFrame({'group':['a','a','a','b','b','b','c','c','c'],
                    'data':[4,3,2,1,12,3,4,5,7]})
data

  group  data
0     a     4
1     a     3
2     a     2
3     b     1
4     b    12
5     b     3
6     c     4
7     c     5
8     c     7

In [2]:
data.sort_values(by=['group','data'],ascending = [False,True],inplace=True)
# ascending = [False,True] 降序升序, inplace=True 直接替换原数据
# 按照group升序，data降序
data

  group  data
6     c     4
7     c     5
8     c     7
3     b     1
5     b     3
4     b    12
2     a     2
1     a     3
0     a     4

In [3]:
data = pd.DataFrame({'k1':['one']*3+['two']*4,
                   'k2':[3,2,1,3,3,4,4]})
data

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
4  two   3
5  two   4
6  two   4

In [4]:
data.sort_values(by='k2')

    k1  k2
2  one   1
1  one   2
0  one   3
3  two   3
4  two   3
5  two   4
6  two   4

In [5]:
data.drop_duplicates() # 删除重复行

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
5  two   4

In [6]:
data.drop_duplicates(subset='k1')

    k1  k2
0  one   3
3  two   3

In [7]:
data = pd.DataFrame({'food':['A1','A2','B1','B2','B3','C1','C2'],'data':[1,2,3,4,5,6,7]})
data

  food  data
0   A1     1
1   A2     2
2   B1     3
3   B2     4
4   B3     5
5   C1     6
6   C2     7

In [8]:
def food_map(series):
    if series['food'] == 'A1':
        return 'A'
    elif series['food'] == 'A2':
        return 'A'
    elif series['food'] == 'B1':
        return 'B'
    elif series['food'] == 'B2':
        return 'B'
    elif series['food'] == 'B3':
        return 'B'
    elif series['food'] == 'C1':
        return 'C'
    elif series['food'] == 'C2':
        return 'C'
data['food_map'] = data.apply(food_map,axis = 'columns') # apply函数，对每一行应用food_map函数
data

  food  data food_map
0   A1     1        A
1   A2     2        A
2   B1     3        B
3   B2     4        B
4   B3     5        B
5   C1     6        C
6   C2     7        C

In [9]:
food2Upper = {
    'A1':'A',
    'A2':'A',
    'B1':'B',
    'B2':'B',
    'B3':'B',
    'C1':'C',
    'C2':'C'
}
data['upper'] = data['food'].map(food2Upper) # map函数，对food列应用food2Upper字典
data

  food  data food_map upper
0   A1     1        A     A
1   A2     2        A     A
2   B1     3        B     B
3   B2     4        B     B
4   B3     5        B     B
5   C1     6        C     C
6   C2     7        C     C

In [12]:
import numpy as np
df = pd.DataFrame({'data1':np.random.randn(5),
                  'data2':np.random.randn(5)})
df2 = df.assign(ration = df['data1']/df['data2']) # assign函数，添加新列 ration = data1/data2

In [14]:
df2

      data1     data2     ration
0  1.175270 -0.162698  -7.223647
1  0.552109  0.006325  87.283843
2  2.140187  0.171085  12.509503
3  0.160223 -0.683015  -0.234582
4  0.335212 -0.346519  -0.967371

In [15]:
df2.drop('ration',axis='columns',inplace=True)

In [16]:
df2

      data1     data2
0  1.175270 -0.162698
1  0.552109  0.006325
2  2.140187  0.171085
3  0.160223 -0.683015
4  0.335212 -0.346519

In [17]:
data = pd.Series([1,2,3,4,5,6,7,8,9])
data

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [18]:
data.replace(9,np.nan,inplace=True)

In [19]:
data

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    7.0
7    8.0
8    NaN
dtype: float64

In [21]:
# bins分割
ages = [15,18,20,21,22,34,41,52,63,79]
bins = [10,40,80]
bins_res = pd.cut(ages,bins) # cut函数，将ages划分为bins
bins_res

[(10, 40], (10, 40], (10, 40], (10, 40], (10, 40], (10, 40], (40, 80], (40, 80], (40, 80], (40, 80]]
Categories (2, interval[int64, right]): [(10, 40] < (40, 80]]

In [23]:
bins_res.codes # codes属性，返回每个值所在的区间

array([0, 0, 0, 0, 0, 0, 1, 1, 1, 1], dtype=int8)

In [27]:
pd.Series(bins_res).value_counts() # value_counts函数，统计每个区间的个数

(10, 40]    6
(40, 80]    4
Name: count, dtype: int64

In [28]:
pd.cut(ages,[10,30,50,80])

[(10, 30], (10, 30], (10, 30], (10, 30], (10, 30], (30, 50], (30, 50], (50, 80], (50, 80], (50, 80]]
Categories (3, interval[int64, right]): [(10, 30] < (30, 50] < (50, 80]]

In [36]:
group_names = ['Yonth','Mille','Old']
pd.Series(pd.cut(ages, [10, 20, 50, 80], labels=group_names)).value_counts() # 数量统计

Mille    4
Yonth    3
Old      3
Name: count, dtype: int64

In [38]:
pd.cut(ages, [10, 20, 50, 80], labels=group_names) # 数量统计原始数据显示

['Yonth', 'Yonth', 'Yonth', 'Mille', 'Mille', 'Mille', 'Mille', 'Old', 'Old', 'Old']
Categories (3, object): ['Yonth' < 'Mille' < 'Old']

In [39]:
df = pd.DataFrame([range(3),[0, np.nan,0],[0,0,np.nan],range(3)])
df

   0    1    2
0  0  1.0  2.0
1  0  NaN  0.0
2  0  0.0  NaN
3  0  1.0  2.0

In [40]:
df.isnull() # isnull函数，判断是否为空

       0      1      2
0  False  False  False
1  False   True  False
2  False  False   True
3  False  False  False

In [41]:
df.isnull().any() # any函数，判断是否有空值， 默认axis=0

0    False
1     True
2     True
dtype: bool

In [43]:
df.isnull().any(axis = 1) # any函数，判断是否有空值， axis=1

0    False
1     True
2     True
3    False
dtype: bool

In [44]:
df.fillna(5) # fillna函数，填充空值

   0    1    2
0  0  1.0  2.0
1  0  5.0  0.0
2  0  0.0  5.0
3  0  1.0  2.0

In [45]:
df[df.isnull().any(axis = 1)] # 筛选有空值的行

   0    1    2
1  0  NaN  0.0
2  0  0.0  NaN